In [156]:
import pandas as pd

In [157]:
df = pd.read_csv("archive/estudiantes.csv")

In [158]:
df

    NOMBRE  EDAD GENERO       CARRERA SEMESTRE
0   Victor    28      M     Auditoria   Primer
1   Josefa    23      F   Informatica   Primer
2     Raul    26      M       Derecho   Quinto
3  Mariana    27      F   Informatica  Septimo
4  Rodrigo    22      M       Derecho  Tercero
5  Gustavo    25      M  Arquitectura  Septimo
6     Lucy    23      F   Informatica   Primer
7    Sofia    24      F      Economia   Noveno

In [159]:
df

    NOMBRE  EDAD GENERO       CARRERA SEMESTRE
0   Victor    28      M     Auditoria   Primer
1   Josefa    23      F   Informatica   Primer
2     Raul    26      M       Derecho   Quinto
3  Mariana    27      F   Informatica  Septimo
4  Rodrigo    22      M       Derecho  Tercero
5  Gustavo    25      M  Arquitectura  Septimo
6     Lucy    23      F   Informatica   Primer
7    Sofia    24      F      Economia   Noveno

In [160]:
df.loc[3, "EDAD"]

27

In [161]:
df.loc[3, "CARRERA"]

'Informatica'

In [162]:
df.loc[:3, ("NOMBRE", "CARRERA")]

    NOMBRE      CARRERA
0   Victor    Auditoria
1   Josefa  Informatica
2     Raul      Derecho
3  Mariana  Informatica

In [163]:
df.iloc[1, :3]

NOMBRE    Josefa
EDAD          23
GENERO         F
Name: 1, dtype: object

In [164]:
df["TURNO"] = pd.Series(["tarde","noche","tarde","mañana","tarde","noche"])

In [165]:
df

    NOMBRE  EDAD GENERO       CARRERA SEMESTRE   TURNO
0   Victor    28      M     Auditoria   Primer   tarde
1   Josefa    23      F   Informatica   Primer   noche
2     Raul    26      M       Derecho   Quinto   tarde
3  Mariana    27      F   Informatica  Septimo  mañana
4  Rodrigo    22      M       Derecho  Tercero   tarde
5  Gustavo    25      M  Arquitectura  Septimo   noche
6     Lucy    23      F   Informatica   Primer     NaN
7    Sofia    24      F      Economia   Noveno     NaN

In [166]:
# Dele DataFrame Column

In [167]:
SEMESTRE = df.pop("SEMESTRE")

In [168]:
df

    NOMBRE  EDAD GENERO       CARRERA   TURNO
0   Victor    28      M     Auditoria   tarde
1   Josefa    23      F   Informatica   noche
2     Raul    26      M       Derecho   tarde
3  Mariana    27      F   Informatica  mañana
4  Rodrigo    22      M       Derecho   tarde
5  Gustavo    25      M  Arquitectura   noche
6     Lucy    23      F   Informatica     NaN
7    Sofia    24      F      Economia     NaN

In [174]:
df = df.append(pd.Series(["carlos", 37, "M", "Sociologia", "tarde"],
                         index=["NOMBRE", "EDAD", "GENERO", "CARRERA", "TURNO"]), ignore_index=True)

C:\Users\ce\AppData\Local\Temp\ipykernel_13500\3618059862.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(pd.Series(["carlos", 37, "M", "Sociologia", "tarde"],

In [170]:
#df

In [171]:
new_row = pd.Series(["Diego", 37, "M", "Sociologia", "tarde"],
                    index=["NOMBRE", "EDAD", "GENERO", "CARRERA", "TURNO"])

In [172]:
df = pd.concat([pd.DataFrame(df), new_row.to_frame().T], ignore_index=True)

In [173]:
df

    NOMBRE EDAD GENERO       CARRERA   TURNO
0   Victor   28      M     Auditoria   tarde
1   Josefa   23      F   Informatica   noche
2     Raul   26      M       Derecho   tarde
3  Mariana   27      F   Informatica  mañana
4  Rodrigo   22      M       Derecho   tarde
5  Gustavo   25      M  Arquitectura   noche
6     Lucy   23      F   Informatica     NaN
7    Sofia   24      F      Economia     NaN
8    Diego   37      M    Sociologia   tarde

In [175]:
df.drop([1,2])

    NOMBRE EDAD GENERO       CARRERA   TURNO
0   Victor   28      M     Auditoria   tarde
3  Mariana   27      F   Informatica  mañana
4  Rodrigo   22      M       Derecho   tarde
5  Gustavo   25      M  Arquitectura   noche
6     Lucy   23      F   Informatica     NaN
7    Sofia   24      F      Economia     NaN
8    Diego   37      M    Sociologia   tarde
9   carlos   37      M    Sociologia   tarde

In [178]:
df[(df["GENERO"]=="F") & (df["EDAD"]>=22)]

    NOMBRE EDAD GENERO      CARRERA   TURNO
1   Josefa   23      F  Informatica   noche
3  Mariana   27      F  Informatica  mañana
6     Lucy   23      F  Informatica     NaN
7    Sofia   24      F     Economia     NaN

In [179]:
df

    NOMBRE EDAD GENERO       CARRERA   TURNO
0   Victor   28      M     Auditoria   tarde
1   Josefa   23      F   Informatica   noche
2     Raul   26      M       Derecho   tarde
3  Mariana   27      F   Informatica  mañana
4  Rodrigo   22      M       Derecho   tarde
5  Gustavo   25      M  Arquitectura   noche
6     Lucy   23      F   Informatica     NaN
7    Sofia   24      F      Economia     NaN
8    Diego   37      M    Sociologia   tarde
9   carlos   37      M    Sociologia   tarde

In [180]:
df.sort_values("CARRERA")

    NOMBRE EDAD GENERO       CARRERA   TURNO
5  Gustavo   25      M  Arquitectura   noche
0   Victor   28      M     Auditoria   tarde
2     Raul   26      M       Derecho   tarde
4  Rodrigo   22      M       Derecho   tarde
7    Sofia   24      F      Economia     NaN
1   Josefa   23      F   Informatica   noche
3  Mariana   27      F   Informatica  mañana
6     Lucy   23      F   Informatica     NaN
8    Diego   37      M    Sociologia   tarde
9   carlos   37      M    Sociologia   tarde

In [181]:
df.sort_values("EDAD")

    NOMBRE EDAD GENERO       CARRERA   TURNO
4  Rodrigo   22      M       Derecho   tarde
1   Josefa   23      F   Informatica   noche
6     Lucy   23      F   Informatica     NaN
7    Sofia   24      F      Economia     NaN
5  Gustavo   25      M  Arquitectura   noche
2     Raul   26      M       Derecho   tarde
3  Mariana   27      F   Informatica  mañana
0   Victor   28      M     Auditoria   tarde
8    Diego   37      M    Sociologia   tarde
9   carlos   37      M    Sociologia   tarde

In [182]:
df.dropna()

    NOMBRE EDAD GENERO       CARRERA   TURNO
0   Victor   28      M     Auditoria   tarde
1   Josefa   23      F   Informatica   noche
2     Raul   26      M       Derecho   tarde
3  Mariana   27      F   Informatica  mañana
4  Rodrigo   22      M       Derecho   tarde
5  Gustavo   25      M  Arquitectura   noche
8    Diego   37      M    Sociologia   tarde
9   carlos   37      M    Sociologia   tarde